stm32-rs/stm32g0xx-hal/src/serial.rs
use core::fmt;
use core::marker::PhantomData;
use core::ops;
use core::pin::Pin;
use core::sync::atomic::{self, Ordering};

use crate::dma::{DmaChannel, ReadDma, Transfer, TransferDirection, WriteDma};
use crate::gpio::{gpioa::*, gpiob::*, gpioc::*, gpiod::*};
use crate::gpio::{AltFunction, DefaultMode};
use crate::prelude::*;
use crate::rcc::Rcc;
use crate::stm32::*;
use crate::time::Bps;
use as_slice::{AsMutSlice, AsSlice};
use nb::block;

/// Serial error
#[derive(Debug)]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
}

#[derive(PartialEq, PartialOrd, Clone, Copy)]
pub enum WordLength {
    DataBits7,
    DataBits8,
    DataBits9,
}

#[derive(PartialEq, PartialOrd, Clone, Copy)]
pub enum Parity {
    ParityNone,
    ParityEven,
    ParityOdd,
}

/// Interrupt event
pub enum Event {
    /// TXFIFO reaches the threshold
    TXFT = 1 << 27,
    /// This bit is set by hardware when the threshold programmed in RXFTCFG in USART_CR3 register is reached.
    RXFT = 1 << 26,

    /// RXFIFO full
    RXFF = 1 << 24,
    /// TXFIFO empty
    TXFE = 1 << 23,

    /// Active when a communication is ongoing on the RX line
    BUSY = 1 << 16,

    /// Receiver timeout.This bit is set by hardware when the timeout value,
    /// programmed in the RTOR register has lapsed, without any communication.
    RTOF = 1 << 11,
    /// Transmit data register empty. New data can be sent
    Txe = 1 << 7,

    /// Transmission Complete. The last data written in the USART_TDR has been transmitted out of the shift register.
    TC = 1 << 6,
    /// New data has been received
    Rxne = 1 << 5,
    /// Idle line state detected
    Idle = 1 << 4,

    /// Overrun error
    ORE = 1 << 3,

    /// Noise detection flag
    NE = 1 << 2,

    /// Framing error
    FE = 1 << 1,

    /// Parity error
    PE = 1 << 0,
}
impl Event {
    fn val(self) -> u32 {
        self as u32
    }
}

#[derive(PartialEq, PartialOrd, Clone, Copy, Debug)]
pub enum StopBits {
    #[doc = "1 stop bit"]
    STOP1 = 0b00,
    #[doc = "0.5 stop bits"]
    STOP0P5 = 0b01,
    #[doc = "2 stop bits"]
    STOP2 = 0b10,
    #[doc = "1.5 stop bits"]
    STOP1P5 = 0b11,
}

impl StopBits {
    fn bits(self) -> u8 {
        self as u8
    }
}

#[derive(PartialEq, PartialOrd, Clone, Copy, Debug)]
pub enum FifoThreshold {
    #[doc = "1/8 of its depth"]
    _1_BYTE = 0b000,
    #[doc = "1/4 of its depth"]
    _2_BYTES = 0b001,
    #[doc = "1/2 of its depth"]
    _4_BYTES = 0b010,
    #[doc = "3/4 of its depth"]
    _6_BYTES = 0b011,
    #[doc = "7/8 of its depth"]
    _7_BYTES = 0b100,
    #[doc = "fifo empty/full"]
    _8_BYTES = 0b101,
}

impl FifoThreshold {
    fn bits(self) -> u8 {
        self as u8
    }
}
#[derive(PartialEq, PartialOrd, Clone, Copy)]
pub struct Config {
    baudrate: Bps,
    wordlength: WordLength,
    parity: Parity,
    stopbits: StopBits,
}

#[derive(PartialEq, PartialOrd, Clone, Copy)]
pub struct FullConfig {
    baudrate: Bps,
    wordlength: WordLength,
    parity: Parity,
    stopbits: StopBits,
    fifo_enable: bool,
    tx_fifo_threshold: FifoThreshold,
    rx_fifo_threshold: FifoThreshold,
    tx_fifo_interrupt: bool,
    rx_fifo_interrupt: bool,
    #[doc = "Number of bits no activity on rx line"]
    receiver_timeout: Option<u32>
}

impl Config {
    pub fn baudrate(mut self, baudrate: Bps) -> Self {
        self.baudrate = baudrate;
        self
    }

    pub fn parity_none(mut self) -> Self {
        self.parity = Parity::ParityNone;
        self
    }

    pub fn parity_even(mut self) -> Self {
        self.parity = Parity::ParityEven;
        self
    }

    pub fn parity_odd(mut self) -> Self {
        self.parity = Parity::ParityOdd;
        self
    }

    pub fn wordlength_8(mut self) -> Self {
        self.wordlength = WordLength::DataBits8;
        self
    }

    pub fn wordlength_9(mut self) -> Self {
        self.wordlength = WordLength::DataBits9;
        self
    }

    pub fn stopbits(mut self, stopbits: StopBits) -> Self {
        self.stopbits = stopbits;
        self
    }
}

impl FullConfig {
    pub fn baudrate(mut self, baudrate: Bps) -> Self {
        self.baudrate = baudrate;
        self
    }

    pub fn parity_none(mut self) -> Self {
        self.parity = Parity::ParityNone;
        self
    }

    pub fn parity_even(mut self) -> Self {
        self.parity = Parity::ParityEven;
        self
    }

    pub fn parity_odd(mut self) -> Self {
        self.parity = Parity::ParityOdd;
        self
    }

    pub fn wordlength_8(mut self) -> Self {
        self.wordlength = WordLength::DataBits8;
        self
    }

    pub fn wordlength_9(mut self) -> Self {
        self.wordlength = WordLength::DataBits9;
        self
    }

    pub fn stopbits(mut self, stopbits: StopBits) -> Self {
        self.stopbits = stopbits;
        self
    }

    pub fn fifo_enable(mut self) -> Self {
        self.fifo_enable = true;
        self
    }

    pub fn tx_fifo_threshold(mut self, threshold: FifoThreshold) -> Self {
        self.tx_fifo_threshold = threshold;
        self
    }

    pub fn rx_fifo_threshold(mut self, threshold: FifoThreshold) -> Self {
        self.rx_fifo_threshold = threshold;
        self
    }

    pub fn tx_fifo_enable_interrupt(mut self) -> Self {
        self.tx_fifo_interrupt = true;
        self
    }

    pub fn rx_fifo_enable_interrupt(mut self) -> Self {
        self.rx_fifo_interrupt = true;
        self
    }

    /// Configure receiver timout in microseconds. Call after baudrate is set.
    pub fn receiver_timeout_us(mut self, timeout_us: u32) -> Self {
        let t = timeout_us as u64 * self.baudrate.0 as u64 / 1_000_000u64;
        self.receiver_timeout = Some(t as u32);
        self
    }

}

#[derive(Debug)]
pub struct InvalidConfig;

impl Default for Config {
    fn default() -> Config {
        let baudrate = 19_200.bps();
        Config {
            baudrate,
            wordlength: WordLength::DataBits8,
            parity: Parity::ParityNone,
            stopbits: StopBits::STOP1,
        }
    }
}

impl Default for FullConfig {
    fn default() -> FullConfig {
        let baudrate = 115_200.bps();
        FullConfig {
            baudrate,
            wordlength: WordLength::DataBits8,
            parity: Parity::ParityNone,
            stopbits: StopBits::STOP1,
            fifo_enable: false,
            tx_fifo_threshold: FifoThreshold::_8_BYTES,
            rx_fifo_threshold: FifoThreshold::_8_BYTES,
            tx_fifo_interrupt: false,
            rx_fifo_interrupt: false,
            receiver_timeout: None
        }
    }
}

