stm32-rs/stm32g0xx-hal/src/serial.rs
                let mut channel = channel;
                channel.set_direction(TransferDirection::MemoryToPeriph);
                channel.set_peripheral_address(usart_ptr, false);
                DmaTx {
                    channel,
                    _usart: PhantomData,
                }
            }

            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1.modify(|_, w| w.txeie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1.modify(|_, w| w.txeie().clear_bit());
            }

        }

        impl Rx<$USARTX> {
            pub fn with_dma<CHANNEL>(self, channel: CHANNEL) -> DmaRx<$USARTX, CHANNEL>
                where CHANNEL: DmaChannel
            {
                let usart = unsafe { &(*$USARTX::ptr()) };
                let usart_ptr = &usart.rdr as *const _ as _;

                let mut channel = channel;
                channel.set_direction(TransferDirection::PeriphToMemory);
                channel.set_peripheral_address(usart_ptr, false);
                DmaRx {
                    channel,
                    _usart: PhantomData,
                }
            }

            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1.modify(|_, w| w.rxneie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1.modify(|_, w| w.rxneie().clear_bit());
            }

            /// Check if receiver timeout has lapsed
            /// Returns the current state of the ISR RTOF bit
            pub fn timeout_lapsed(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr.read().rtof().bit_is_set()
            }

            /// Clear pending receiver timeout interrupt
            pub fn clear_timeout(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.icr.write(|w| w.rtocf().set_bit());
            }

            /// Check if overrun error has occurred
            pub fn overrun_error(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr.read().ore().bit_is_set()
            }

            pub fn clear_error(&mut self, event: Event) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                match event {
                    Event::ORE => usart.icr.write(|w| w.orecf().set_bit()),
                    Event::NE => usart.icr.write(|w| w.ncf().set_bit()),
                    Event::FE => usart.icr.write(|w| w.fecf().set_bit()),
                    Event::PE => usart.icr.write(|w| w.pecf().set_bit()),
                    _ => {},
                }
            }

        }

        impl<CHANNEL, B> ReadDma<B> for DmaRx<$USARTX, CHANNEL>
        where
            CHANNEL: DmaChannel,
            B: ops::DerefMut + 'static,
            B::Target: AsMutSlice<Element = u8> + Unpin,
            Self: core::marker::Sized,
        {
            fn read(mut self, buffer: Pin<B>) -> Transfer<Self, Pin<B>> {
                let mut buffer = buffer;
                let slice = buffer.as_mut_slice();
                let (ptr, len) = (slice.as_ptr(), slice.len());

                let dma_channel = &mut self.channel;
                dma_channel.set_memory_address(ptr as u32, true);
                dma_channel.set_transfer_length(len);

                atomic::compiler_fence(Ordering::SeqCst);
                dma_channel.start();

                Transfer {
                    buffer,
                    channel: self,
                }
            }
        }

        impl<CHANNEL, B> WriteDma<B> for DmaTx<$USARTX, CHANNEL>
        where
            CHANNEL: DmaChannel,
            B: ops::Deref + 'static,
            B::Target: AsSlice<Element = u8> + Unpin,
            Self: core::marker::Sized,
        {
            fn write(mut self, buffer: Pin<B>) -> Transfer<Self, Pin<B>> {
                let slice = buffer.as_slice();
                let (ptr, len) = (slice.as_ptr(), slice.len());

                let dma_channel = &mut self.channel;
                dma_channel.set_memory_address(ptr as u32, true);
                dma_channel.set_transfer_length(len);

                atomic::compiler_fence(Ordering::SeqCst);
                dma_channel.start();

                Transfer {
                    buffer,
                    channel: self,
                }
            }
        }

        impl hal::serial::Read<u8> for Rx<$USARTX> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                let isr = usart.isr.read();
                Err(
                    if isr.pe().bit_is_set() {
                        usart.icr.write(|w| w.pecf().set_bit());
                        nb::Error::Other(Error::Parity)
                    } else if isr.fe().bit_is_set() {
                        usart.icr.write(|w| w.fecf().set_bit());
                        nb::Error::Other(Error::Framing)
                    } else if isr.nf().bit_is_set() {
                        usart.icr.write(|w| w.ncf().set_bit());
                        nb::Error::Other(Error::Noise)
                    } else if isr.ore().bit_is_set() {
                        usart.icr.write(|w| w.orecf().set_bit());
                        nb::Error::Other(Error::Overrun)
                    } else if isr.rxne().bit_is_set() {
                        return Ok(usart.rdr.read().bits() as u8)
                    } else {
                        nb::Error::WouldBlock
                    }
                )
            }
        }

        impl hal::serial::Read<u8> for Serial<$USARTX> {
            type Error = Error;

