stm32-rs/stm32g0xx-hal/src/serial.rs
            fn read(&mut self) -> nb::Result<u8, Error> {
                self.rx.read()
            }
        }

        impl hal::serial::Write<u8> for Tx<$USARTX> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr.read().tc().bit_is_set() {
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr.read().txe().bit_is_set() {
                    usart.tdr.write(|w| unsafe { w.bits(byte as u32) });
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }
        }

        impl hal::serial::Write<u8> for Serial<$USARTX> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                self.tx.flush()
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                self.tx.write(byte)
            }
        }
    }
}

uart!(
    USART1, usart1, apbenr2, usart1en, 1,
    tx: [
        (PA9<DefaultMode>, AltFunction::AF1),
        (PB6<DefaultMode>, AltFunction::AF0),
        (PC4<DefaultMode>, AltFunction::AF1),
    ],
    rx: [
        (PA10<DefaultMode>, AltFunction::AF1),
        (PB7<DefaultMode>, AltFunction::AF0),
        (PC5<DefaultMode>, AltFunction::AF1),
    ],
);

uart!(
    USART2, usart2, apbenr1, usart2en, 1,
    tx: [
        (PA2<DefaultMode>, AltFunction::AF1),
        (PA14<DefaultMode>, AltFunction::AF1),
        (PD5<DefaultMode>, AltFunction::AF0),
    ],
    rx: [
        (PA3<DefaultMode>, AltFunction::AF1),
        (PA15<DefaultMode>, AltFunction::AF1),
        (PD6<DefaultMode>, AltFunction::AF0),
    ],
);

#[cfg(any(feature = "stm32g070",feature = "stm32g071", feature = "stm32g081"))]
uart!(
    USART3, usart3, apbenr1, usart3en, 1,
    tx: [
        (PA5<DefaultMode>, AltFunction::AF4),
        (PB2<DefaultMode>, AltFunction::AF4),
        (PB8<DefaultMode>, AltFunction::AF4),
        (PB10<DefaultMode>, AltFunction::AF4),
        (PC4<DefaultMode>, AltFunction::AF1),
        (PC10<DefaultMode>, AltFunction::AF1),
        (PD8<DefaultMode>, AltFunction::AF1),
    ],
    rx: [
        (PB0<DefaultMode>, AltFunction::AF4),
        (PB9<DefaultMode>, AltFunction::AF4),
        (PB11<DefaultMode>, AltFunction::AF4),
        (PC5<DefaultMode>, AltFunction::AF1),
        (PC11<DefaultMode>, AltFunction::AF1),
        (PD9<DefaultMode>, AltFunction::AF1),
    ],
);

#[cfg(any(feature = "stm32g070",feature = "stm32g071", feature = "stm32g081"))]
uart!(
    USART4, usart4, apbenr1, usart4en, 1,
    tx: [
        (PA0<DefaultMode>, AltFunction::AF4),
        (PC10<DefaultMode>, AltFunction::AF1),
    ],
    rx: [
        (PC11<DefaultMode>, AltFunction::AF1),
        (PA1<DefaultMode>, AltFunction::AF4),
    ],
);

// #[cfg(feature = "stm32g0x1")]
// uart!(
//     LPUART, lpuart, apbenr1, lpuart1en, 256,
//     tx: [
//         (PA2<DefaultMode>, AltFunction::AF6),
//         (PB11<DefaultMode>, AltFunction::AF1),
//         (PC1<DefaultMode>, AltFunction::AF1),
//     ],
//     rx: [
//         (PA3<DefaultMode>, AltFunction::AF6),
//         (PB10<DefaultMode>, AltFunction::AF1),
//         (PC0<DefaultMode>, AltFunction::AF1),
//     ],
// );


/// This traits unlocks full functionality of the USART peripheral
pub trait FullSerial {

    fn usart_full<TX, RX>(
        usart: USART1,
        tx: TX,
        rx: RX,
        config: FullConfig,
        rcc: &mut Rcc,
    ) -> Result<Serial<USART1>, InvalidConfig>
    where
        TX: TxPin<USART1>,
        RX: RxPin<USART1>;
}

impl FullSerial for Serial<USART1> {

    fn usart_full<TX, RX>(
        usart: USART1,
        tx: TX,
        rx: RX,
        config: FullConfig,
        rcc: &mut Rcc,
    ) -> Result<Self, InvalidConfig> where
        TX: TxPin<USART1>,
        RX: RxPin<USART1>
    {
        tx.setup();
        rx.setup();

        // Enable clock for USART
        // rcc.rb.$apbXenr.modify(|_, w| w.$usartXen().set_bit());
        rcc.rb.apbenr2.modify(|_, w| w.usart1en().set_bit());

        let clk = rcc.clocks.apb_clk.0 as u64;
        let bdr = config.baudrate.0 as u64;
        let clk_mul = 1;
        let div = (clk_mul * clk) / bdr;
        usart.brr.write(|w| unsafe { w.bits(div as u32) });

        usart.cr1.reset();
        usart.cr2.reset();
        usart.cr3.reset();


        usart.cr2.write(|w| unsafe {
            w.stop().bits(config.stopbits.bits())
        });

        if let Some(timeout) = config.receiver_timeout {
            usart.cr1.write(|w| w.rtoie().set_bit());
            usart.cr2.modify(|_, w| w.rtoen().set_bit());
            usart.rtor.write(|w| unsafe { w.rto().bits(timeout) });
        }

        usart.cr3.write(|w| unsafe {
            w.txftcfg().bits(config.tx_fifo_threshold.bits())
            .rxftcfg().bits(config.rx_fifo_threshold.bits())
            .txftie().bit(config.tx_fifo_interrupt)
            .rxftie().bit(config.rx_fifo_interrupt)
        });

        usart.cr1.modify(|_, w| {
            w.ue()
            .set_bit()
            .te()
            .set_bit()
            .re()
            .set_bit()
            .m0()
            .bit(config.wordlength == WordLength::DataBits7)
            .m1()
            .bit(config.wordlength == WordLength::DataBits9)
            .pce()
            .bit(config.parity != Parity::ParityNone)
            .ps()
            .bit(config.parity == Parity::ParityOdd)
            .fifoen()
            .bit(config.fifo_enable)
        });


        Ok(Serial {
            tx: Tx { _usart: PhantomData },
            rx: Rx { _usart: PhantomData },
            usart
        })


    }

    // fn is_pending(&mut self, event: Event) -> bool {
    //     (self.usart.isr.read().bits() & event.val()) != 0
    // }

    // fn unpend(&mut self, event: Event) {
    //     // mask the allowed bits
    //     let mask: u32 = 0x123BFF;
    //     self.usart.icr.write(|w| unsafe {
    //         w.bits(event.val() & mask)
    //     });
    // }



}